const agreements = [
  {
    health: 'Я чувствую себя здоровым и не имею симптомов заболеваний.',
  },
  {
    noAlcohol:
      'Я не нахожусь в состоянии алкогольного опьянения или под воздействием наркотических и психотропных веществ.',
  },
  {
    isProvided:
      'Я обеспечен необходимыми средствами индивидуальной и коллективной защиты (например, каска, перчатки, защитные очки).',
  },
  {
    emergency:
      'Я знаю порядок действий при аварийных и экстренных ситуациях, включая эвакуацию и вызов помощи.',
  },
  {
    compliance:
      'Я ознакомлен с правилами безопасности на рабочем месте и обязуюсь их соблюдать.',
  },
  {
    isPassed:
      'Я прошел инструктаж по безопасному выполнению своих обязанностей.',
  },
  {
    report:
      'Я понимаю важность соблюдения норм охраны труда и готов сообщать о любых нарушениях.',
  },
  {
    medAid:
      'Я осведомлен о наличии аптечки первой помощи и знаю, как ее использовать.',
  },
  { attention: 'Я не знаю что мне делать и как быть' },
]

export default agreements

// {
//   instr_type: 'Первичный',
//   instr_text: {
//     page: 1,
//     results:[{text: 'html-text'}],
//     total_pages: 10,
//     total_results: 100
//   },
//   instr_agree: agreements
// }
